app/controllers/ingredient_controller.rb

INSERT INTO "ingredients" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "sear"], ["created_at", "2015-11-20 00:26:35.698321"], ["updated_at", "2015-11-20 00:26:35.698321"]]
---
	def add
		if user_signed_in?
			if User.exists?(current_user.id)
				Ingredient.create(:title => params[:title], :description => params[:description])

SELECT "ingredients".* FROM "ingredients"
---
	def list
		@ingredients=Ingredient.all