app/controllers/picture_controller.rb

	def add
		if user_signed_in?
			if User.exists?(current_user.id)
				User.find(current_user.id).recipes.find(params[:id]).pictures.create(:title => params[:title], :description => params[:description], :url => params[:url])
---
INSERT INTO "pictures" ("title", "description", "url", "recipe_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "$scope.pictureTitle"], ["description", "mkm"], ["url", "mlk"], ["recipe_id", 3], ["created_at", "2015-11-19 18:17:55.025982"], ["updated_at", "2015-11-19 18:17:55.025982"]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."user_id" = ? AND "recipes"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]