app/controllers/recipe_controller.rb

INSERT INTO "recipes" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "\"pizza\""], ["description", "\"pizza neptune\""], ["user_id", 1], ["created_at", "2015-11-17 15:10:44.029818"], ["updated_at", "2015-11-17 15:10:44.029818"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
	def add
		@id = nil
		if user_signed_in?
			if User.exists?(current_user.id)
				u = User.find(current_user.id).recipes.create(:title => params[:title], :description => params[:description])

SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."user_id" = ? AND "recipes"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
	def addIngredient
		if user_signed_in?
			if User.exists?(current_user.id)
				User.find(current_user.id).recipes.find(params[:id]).ingredients.push(Ingredient.find(params[:ingredient_id]))